In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})

In [3]:
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [4]:
# get the unique values of the dataframe
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [5]:
# get the non unique values of the dataframe
df['col1'].nunique()

4

In [6]:
# get the number of occurrences per data
df['col2'].value_counts()

col2
444    2
555    1
666    1
Name: count, dtype: int64

In [7]:
# Col 1 > 2
# Col 2 = 444

new_df = df[(df['col2']==444) & (df['col1'] > 2)]

In [8]:
new_df

   col1  col2 col3
3     4   444  xyz

In [9]:
def times_two(number):
    return number*2

In [10]:
# add a new column as result of applying a function
df['new'] = df['col1'].apply(times_two)

In [11]:
df

   col1  col2 col3  new
0     1   444  abc    2
1     2   555  def    4
2     3   666  ghi    6
3     4   444  xyz    8

In [12]:
# drop a column
del df['new']

In [13]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [14]:
df.describe()

           col1        col2
count  4.000000    4.000000
mean   2.500000  527.250000
std    1.290994  106.274409
min    1.000000  444.000000
25%    1.750000  444.000000
50%    2.500000  499.500000
75%    3.250000  582.750000
max    4.000000  666.000000

In [15]:
# sorting by
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [16]:
# sorting by
df.sort_values('col2', ascending=False)

   col1  col2 col3
2     3   666  ghi
1     2   555  def
0     1   444  abc
3     4   444  xyz

In [17]:
df = pd.read_csv('bank.csv')

In [18]:
df.head()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,30,unemployed,married,primary,no,1787,no,no,cellular,19,oct,79,1,-1,0,unknown,no
1,33,services,married,secondary,no,4789,yes,yes,cellular,11,may,220,1,339,4,failure,no
2,35,management,single,tertiary,no,1350,yes,no,cellular,16,apr,185,1,330,1,failure,no
3,30,management,married,tertiary,no,1476,yes,yes,unknown,3,jun,199,4,-1,0,unknown,no
4,59,blue-collar,married,secondary,no,0,yes,no,unknown,5,may,226,1,-1,0,unknown,no

In [19]:
df['age'].mean()

41.17009511170095

In [21]:
# search by index
# what is the marital status of the youngest person in the dataset?
index_youngest = df['age'].idxmin()
df.iloc[index_youngest]['marital']

'single'

In [24]:
# return the number of unique values of a column
# how many unique job categories are there?
df['job'].nunique()

12

In [26]:
# how many people are there per job category?
df['job'].value_counts()

job
management       969
blue-collar      946
technician       768
admin.           478
services         417
retired          230
self-employed    183
entrepreneur     168
unemployed       128
housemaid        112
student           84
unknown           38
Name: count, dtype: int64

In [27]:
df['marital'].value_counts()

marital
married     2797
single      1196
divorced     528
Name: count, dtype: int64

In [30]:
# what percent of people in the dataset were married?
a = df['marital'].value_counts()['married']
b = len(df)
per = (a / b)*100
print(per)

61.86684361866843